


public class Main {
    //TODO
    // 1. Сделать глобальную переменную static Scanner и считать два значения в метоже main, передать их в функцию, вычислить
    // их разность и вывести на консоль их метода main


    // 1. Сделать глобальную переменную static Scanner
    // 2. считать два значения в метоже main



    // 1. Создать глобальную переменную Scanner (так же как в дз)
    // 2. Считать 3 значения из консоли в методе main
    // 3. Передать эти 3 значения в метод findMin(int a, int b, int c)
    // 4. Найти меньшее значение из 3
    // 5. Вернуть это значение
    // 6. В методе main вывести полученное значение в консоль

//TODO
    // 1. Создать глобальную переменную Scanner (так же как в дз)
    // 2. Считать 3 значения из консоли в методе main
    // 3. Передать эти 3 значения в метод findMax(int a, int b, int c)
    // 4. Найти большее значение из 3
    // 5. Вернуть это значение
    // 6. В методе main вывести полученное значение в консоль



  /*  static Scanner scanner = new Scanner(System.in);

    public static void main(String[] args) {

        int a = scanner.nextInt(5);
        int b = scanner.nextInt(10);
        int c = scanner.nextInt(15);

        int j = calc(a, b, c);

        System.out.println(a + " " + b + " " + c + " ");

        let calc = (a, b, c)

        for (int j = 0; j < str.length(); j++) {
            if (str.charAt(j) == 'Я' || str.charAt(j) == 'я') {
                System.out.println(str.charAt(j));
            }*/



}
    }
